RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
/*  Bit definition for AOS_PEVNTTRGSR register  */
#define AOS_PEVNTTRGSR_TRGSEL_POS                      (0U)
#define AOS_PEVNTTRGSR_TRGSEL                          (0x000001FFUL)
#define AOS_PEVNTTRGSR_COMTRG_EN_POS                   (30U)
#define AOS_PEVNTTRGSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_PEVNTTRGSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_PEVNTTRGSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_TMR0_HTSSR register  */
#define AOS_TMR0_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR0_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR0_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR0_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR0_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_TMR2_HTSSR register  */
#define AOS_TMR2_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMR2_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMR2_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMR2_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMR2_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELA register  */
#define AOS_HASH_ITRGSELA_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELA_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELA_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELA_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_HASH_ITRGSELB register  */
#define AOS_HASH_ITRGSELB_TRGSEL_POS                   (0U)
#define AOS_HASH_ITRGSELB_TRGSEL                       (0x000001FFUL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_POS                (30U)
#define AOS_HASH_ITRGSELB_COMTRG_EN                    (0xC0000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_0                  (0x40000000UL)
#define AOS_HASH_ITRGSELB_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_TMRA_HTSSR register  */
#define AOS_TMRA_HTSSR_TRGSEL_POS                      (0U)
#define AOS_TMRA_HTSSR_TRGSEL                          (0x000001FFUL)
#define AOS_TMRA_HTSSR_COMTRG_EN_POS                   (30U)
#define AOS_TMRA_HTSSR_COMTRG_EN                       (0xC0000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_0                     (0x40000000UL)
#define AOS_TMRA_HTSSR_COMTRG_EN_1                     (0x80000000UL)

/*  Bit definition for AOS_OTS_TRG register  */
#define AOS_OTS_TRG_TRGSEL_POS                         (0U)
#define AOS_OTS_TRG_TRGSEL                             (0x000001FFUL)
#define AOS_OTS_TRG_COMTRG_EN_POS                      (30U)
#define AOS_OTS_TRG_COMTRG_EN                          (0xC0000000UL)
#define AOS_OTS_TRG_COMTRG_EN_0                        (0x40000000UL)
#define AOS_OTS_TRG_COMTRG_EN_1                        (0x80000000UL)

/*  Bit definition for AOS_ADC1_ITRGSELR register  */
#define AOS_ADC1_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC1_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC1_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC1_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_ADC2_ITRGSELR register  */
#define AOS_ADC2_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC2_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC2_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC2_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_ADC3_ITRGSELR register  */
#define AOS_ADC3_ITRGSELR_TRGSEL_POS                   (0U)
#define AOS_ADC3_ITRGSELR_TRGSEL                       (0x000001FFUL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_POS                (30U)
#define AOS_ADC3_ITRGSELR_COMTRG_EN                    (0xC0000000UL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_0                  (0x40000000UL)
#define AOS_ADC3_ITRGSELR_COMTRG_EN_1                  (0x80000000UL)

/*  Bit definition for AOS_COMTRG1 register  */
#define AOS_COMTRG1_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_COMTRG2 register  */
#define AOS_COMTRG2_TRGSEL                             (0x000001FFUL)

/*  Bit definition for AOS_PEVNTDIRR register  */
#define AOS_PEVNTDIRR_PDIR                             (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTIDR register  */
#define AOS_PEVNTIDR_PIN                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTODR register  */
#define AOS_PEVNTODR_POUT                              (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTORR register  */
#define AOS_PEVNTORR_POR                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTOSR register  */
#define AOS_PEVNTOSR_POS                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTRISR register  */
#define AOS_PEVNTRISR_RIS                              (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTFAL register  */
#define AOS_PEVNTFAL_FAL                               (0x0000FFFFUL)

/*  Bit definition for AOS_PEVNTNFCR register  */
#define AOS_PEVNTNFCR_NFEN1_POS                        (0U)
#define AOS_PEVNTNFCR_NFEN1                            (0x00000001UL)
#define AOS_PEVNTNFCR_DIVS1_POS                        (1U)
#define AOS_PEVNTNFCR_DIVS1                            (0x00000006UL)
#define AOS_PEVNTNFCR_NFEN2_POS                        (8U)
#define AOS_PEVNTNFCR_NFEN2                            (0x00000100UL)
#define AOS_PEVNTNFCR_DIVS2_POS                        (9U)
#define AOS_PEVNTNFCR_DIVS2                            (0x00000600UL)
#define AOS_PEVNTNFCR_NFEN3_POS                        (16U)
#define AOS_PEVNTNFCR_NFEN3                            (0x00010000UL)
#define AOS_PEVNTNFCR_DIVS3_POS                        (17U)
#define AOS_PEVNTNFCR_DIVS3                            (0x00060000UL)
#define AOS_PEVNTNFCR_NFEN4_POS                        (24U)
#define AOS_PEVNTNFCR_NFEN4                            (0x01000000UL)
#define AOS_PEVNTNFCR_DIVS4_POS                        (25U)
#define AOS_PEVNTNFCR_DIVS4                            (0x06000000UL)

