RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
/*  Bit definition for ETH_DMA_RXPOLLR register  */
#define ETH_DMA_RXPOLLR_RXPOLL                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_RXDLADR register  */
#define ETH_DMA_RXDLADR_RXDLAD                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_TXDLADR register  */
#define ETH_DMA_TXDLADR_TXDLAD                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_DMASTSR register  */
#define ETH_DMA_DMASTSR_TIS_POS                        (0U)
#define ETH_DMA_DMASTSR_TIS                            (0x00000001UL)
#define ETH_DMA_DMASTSR_TSS_POS                        (1U)
#define ETH_DMA_DMASTSR_TSS                            (0x00000002UL)
#define ETH_DMA_DMASTSR_TUS_POS                        (2U)
#define ETH_DMA_DMASTSR_TUS                            (0x00000004UL)
#define ETH_DMA_DMASTSR_TJS_POS                        (3U)
#define ETH_DMA_DMASTSR_TJS                            (0x00000008UL)
#define ETH_DMA_DMASTSR_OVS_POS                        (4U)
#define ETH_DMA_DMASTSR_OVS                            (0x00000010UL)
#define ETH_DMA_DMASTSR_UNS_POS                        (5U)
#define ETH_DMA_DMASTSR_UNS                            (0x00000020UL)
#define ETH_DMA_DMASTSR_RIS_POS                        (6U)
#define ETH_DMA_DMASTSR_RIS                            (0x00000040UL)
#define ETH_DMA_DMASTSR_RUS_POS                        (7U)
#define ETH_DMA_DMASTSR_RUS                            (0x00000080UL)
#define ETH_DMA_DMASTSR_RSS_POS                        (8U)
#define ETH_DMA_DMASTSR_RSS                            (0x00000100UL)
#define ETH_DMA_DMASTSR_RWS_POS                        (9U)
#define ETH_DMA_DMASTSR_RWS                            (0x00000200UL)
#define ETH_DMA_DMASTSR_ETS_POS                        (10U)
#define ETH_DMA_DMASTSR_ETS                            (0x00000400UL)
#define ETH_DMA_DMASTSR_FBS_POS                        (13U)
#define ETH_DMA_DMASTSR_FBS                            (0x00002000UL)
#define ETH_DMA_DMASTSR_ERS_POS                        (14U)
#define ETH_DMA_DMASTSR_ERS                            (0x00004000UL)
#define ETH_DMA_DMASTSR_AIS_POS                        (15U)
#define ETH_DMA_DMASTSR_AIS                            (0x00008000UL)
#define ETH_DMA_DMASTSR_NIS_POS                        (16U)
#define ETH_DMA_DMASTSR_NIS                            (0x00010000UL)
#define ETH_DMA_DMASTSR_RSTS_POS                       (17U)
#define ETH_DMA_DMASTSR_RSTS                           (0x000E0000UL)
#define ETH_DMA_DMASTSR_RSTS_0                         (0x00020000UL)
#define ETH_DMA_DMASTSR_RSTS_1                         (0x00040000UL)
#define ETH_DMA_DMASTSR_RSTS_2                         (0x00080000UL)
#define ETH_DMA_DMASTSR_TSTS_POS                       (20U)
#define ETH_DMA_DMASTSR_TSTS                           (0x00700000UL)
#define ETH_DMA_DMASTSR_TSTS_0                         (0x00100000UL)
#define ETH_DMA_DMASTSR_TSTS_1                         (0x00200000UL)
#define ETH_DMA_DMASTSR_TSTS_2                         (0x00400000UL)
#define ETH_DMA_DMASTSR_EBUS_POS                       (23U)
#define ETH_DMA_DMASTSR_EBUS                           (0x03800000UL)
#define ETH_DMA_DMASTSR_EBUS_0                         (0x00800000UL)
#define ETH_DMA_DMASTSR_EBUS_1                         (0x01000000UL)
#define ETH_DMA_DMASTSR_EBUS_2                         (0x02000000UL)
#define ETH_DMA_DMASTSR_MMCS_POS                       (27U)
#define ETH_DMA_DMASTSR_MMCS                           (0x08000000UL)
#define ETH_DMA_DMASTSR_PMTS_POS                       (28U)
#define ETH_DMA_DMASTSR_PMTS                           (0x10000000UL)
#define ETH_DMA_DMASTSR_PTPS_POS                       (29U)
#define ETH_DMA_DMASTSR_PTPS                           (0x20000000UL)

/*  Bit definition for ETH_DMA_OPRMODR register  */
#define ETH_DMA_OPRMODR_STR_POS                        (1U)
#define ETH_DMA_OPRMODR_STR                            (0x00000002UL)
#define ETH_DMA_OPRMODR_OSF_POS                        (2U)
#define ETH_DMA_OPRMODR_OSF                            (0x00000004UL)
#define ETH_DMA_OPRMODR_RTC_POS                        (3U)
#define ETH_DMA_OPRMODR_RTC                            (0x00000018UL)
#define ETH_DMA_OPRMODR_RTC_0                          (0x00000008UL)
#define ETH_DMA_OPRMODR_RTC_1                          (0x00000010UL)
#define ETH_DMA_OPRMODR_DGF_POS                        (5U)
#define ETH_DMA_OPRMODR_DGF                            (0x00000020UL)
#define ETH_DMA_OPRMODR_FUF_POS                        (6U)
#define ETH_DMA_OPRMODR_FUF                            (0x00000040UL)
#define ETH_DMA_OPRMODR_FEF_POS                        (7U)
#define ETH_DMA_OPRMODR_FEF                            (0x00000080UL)
#define ETH_DMA_OPRMODR_STT_POS                        (13U)
#define ETH_DMA_OPRMODR_STT                            (0x00002000UL)
#define ETH_DMA_OPRMODR_TTC_POS                        (14U)
#define ETH_DMA_OPRMODR_TTC                            (0x0001C000UL)
#define ETH_DMA_OPRMODR_TTC_0                          (0x00004000UL)
#define ETH_DMA_OPRMODR_TTC_1                          (0x00008000UL)
#define ETH_DMA_OPRMODR_TTC_2                          (0x00010000UL)
#define ETH_DMA_OPRMODR_FTF_POS                        (20U)
#define ETH_DMA_OPRMODR_FTF                            (0x00100000UL)
#define ETH_DMA_OPRMODR_TSF_POS                        (21U)
#define ETH_DMA_OPRMODR_TSF                            (0x00200000UL)
#define ETH_DMA_OPRMODR_DFRF_POS                       (24U)
#define ETH_DMA_OPRMODR_DFRF                           (0x01000000UL)
#define ETH_DMA_OPRMODR_RSF_POS                        (25U)
#define ETH_DMA_OPRMODR_RSF                            (0x02000000UL)
#define ETH_DMA_OPRMODR_DTCOE_POS                      (26U)
#define ETH_DMA_OPRMODR_DTCOE                          (0x04000000UL)

/*  Bit definition for ETH_DMA_INTENAR register  */
#define ETH_DMA_INTENAR_TIE_POS                        (0U)
#define ETH_DMA_INTENAR_TIE                            (0x00000001UL)
#define ETH_DMA_INTENAR_TSE_POS                        (1U)
#define ETH_DMA_INTENAR_TSE                            (0x00000002UL)
#define ETH_DMA_INTENAR_TUE_POS                        (2U)
#define ETH_DMA_INTENAR_TUE                            (0x00000004UL)
#define ETH_DMA_INTENAR_TJE_POS                        (3U)
#define ETH_DMA_INTENAR_TJE                            (0x00000008UL)
#define ETH_DMA_INTENAR_OVE_POS                        (4U)
#define ETH_DMA_INTENAR_OVE                            (0x00000010UL)
#define ETH_DMA_INTENAR_UNE_POS                        (5U)
#define ETH_DMA_INTENAR_UNE                            (0x00000020UL)
#define ETH_DMA_INTENAR_RIE_POS                        (6U)
#define ETH_DMA_INTENAR_RIE                            (0x00000040UL)
#define ETH_DMA_INTENAR_RUE_POS                        (7U)
#define ETH_DMA_INTENAR_RUE                            (0x00000080UL)
#define ETH_DMA_INTENAR_RSE_POS                        (8U)
#define ETH_DMA_INTENAR_RSE                            (0x00000100UL)
#define ETH_DMA_INTENAR_RWE_POS                        (9U)
#define ETH_DMA_INTENAR_RWE                            (0x00000200UL)
#define ETH_DMA_INTENAR_ETE_POS                        (10U)
#define ETH_DMA_INTENAR_ETE                            (0x00000400UL)
#define ETH_DMA_INTENAR_FBE_POS                        (13U)
#define ETH_DMA_INTENAR_FBE                            (0x00002000UL)
#define ETH_DMA_INTENAR_ERE_POS                        (14U)
#define ETH_DMA_INTENAR_ERE                            (0x00004000UL)
#define ETH_DMA_INTENAR_AIE_POS                        (15U)
#define ETH_DMA_INTENAR_AIE                            (0x00008000UL)
#define ETH_DMA_INTENAR_NIE_POS                        (16U)
#define ETH_DMA_INTENAR_NIE                            (0x00010000UL)

/*  Bit definition for ETH_DMA_RFRCNTR register  */
#define ETH_DMA_RFRCNTR_UNACNT_POS                     (0U)
#define ETH_DMA_RFRCNTR_UNACNT                         (0x0000FFFFUL)
#define ETH_DMA_RFRCNTR_UNAOVF_POS                     (16U)
#define ETH_DMA_RFRCNTR_UNAOVF                         (0x00010000UL)
#define ETH_DMA_RFRCNTR_OVFCNT_POS                     (17U)
#define ETH_DMA_RFRCNTR_OVFCNT                         (0x0FFE0000UL)
#define ETH_DMA_RFRCNTR_OVFOVF_POS                     (28U)
#define ETH_DMA_RFRCNTR_OVFOVF                         (0x10000000UL)

