RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
/*  Bit definition for ETH_DMA_REVWDTR register  */
#define ETH_DMA_REVWDTR_RIWT                           (0x000000FFUL)

/*  Bit definition for ETH_DMA_CHTXDER register  */
#define ETH_DMA_CHTXDER_CHTXDE                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHRXDER register  */
#define ETH_DMA_CHRXDER_CHRXDE                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHTXBFR register  */
#define ETH_DMA_CHTXBFR_CHTXBF                         (0xFFFFFFFFUL)

/*  Bit definition for ETH_DMA_CHRXBFR register  */
#define ETH_DMA_CHRXBFR_CHRXBF                         (0xFFFFFFFFUL)

/*******************************************************************************
                Bit definition for Peripheral FCM
*******************************************************************************/
/*  Bit definition for FCM_LVR register  */
#define FCM_LVR_LVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_UVR register  */
#define FCM_UVR_UVR                                    (0x0000FFFFUL)

/*  Bit definition for FCM_CNTR register  */
#define FCM_CNTR_CNTR                                  (0x0000FFFFUL)

/*  Bit definition for FCM_STR register  */
#define FCM_STR_START                                  (0x00000001UL)

/*  Bit definition for FCM_MCCR register  */
#define FCM_MCCR_MDIVS_POS                             (0U)
#define FCM_MCCR_MDIVS                                 (0x00000003UL)
#define FCM_MCCR_MCKS_POS                              (4U)
#define FCM_MCCR_MCKS                                  (0x000000F0UL)

/*  Bit definition for FCM_RCCR register  */
#define FCM_RCCR_RDIVS_POS                             (0U)
#define FCM_RCCR_RDIVS                                 (0x00000003UL)
#define FCM_RCCR_RCKS_POS                              (3U)
#define FCM_RCCR_RCKS                                  (0x00000078UL)
#define FCM_RCCR_INEXS_POS                             (7U)
#define FCM_RCCR_INEXS                                 (0x00000080UL)
#define FCM_RCCR_DNFS_POS                              (8U)
#define FCM_RCCR_DNFS                                  (0x00000300UL)
#define FCM_RCCR_DNFS_0                                (0x00000100UL)
#define FCM_RCCR_DNFS_1                                (0x00000200UL)
#define FCM_RCCR_EDGES_POS                             (12U)
#define FCM_RCCR_EDGES                                 (0x00003000UL)
#define FCM_RCCR_EDGES_0                               (0x00001000UL)
#define FCM_RCCR_EDGES_1                               (0x00002000UL)
#define FCM_RCCR_EXREFE_POS                            (15U)
#define FCM_RCCR_EXREFE                                (0x00008000UL)

/*  Bit definition for FCM_RIER register  */
#define FCM_RIER_ERRIE_POS                             (0U)
#define FCM_RIER_ERRIE                                 (0x00000001UL)
#define FCM_RIER_MENDIE_POS                            (1U)
#define FCM_RIER_MENDIE                                (0x00000002UL)
#define FCM_RIER_OVFIE_POS                             (2U)
#define FCM_RIER_OVFIE                                 (0x00000004UL)
#define FCM_RIER_ERRINTRS_POS                          (4U)
#define FCM_RIER_ERRINTRS                              (0x00000010UL)
#define FCM_RIER_ERRE_POS                              (7U)
#define FCM_RIER_ERRE                                  (0x00000080UL)

/*  Bit definition for FCM_SR register  */
#define FCM_SR_ERRF_POS                                (0U)
#define FCM_SR_ERRF                                    (0x00000001UL)
#define FCM_SR_MENDF_POS                               (1U)
#define FCM_SR_MENDF                                   (0x00000002UL)
#define FCM_SR_OVF_POS                                 (2U)
#define FCM_SR_OVF                                     (0x00000004UL)

/*  Bit definition for FCM_CLR register  */
#define FCM_CLR_ERRFCLR_POS                            (0U)
#define FCM_CLR_ERRFCLR                                (0x00000001UL)
#define FCM_CLR_MENDFCLR_POS                           (1U)
#define FCM_CLR_MENDFCLR                               (0x00000002UL)
#define FCM_CLR_OVFCLR_POS                             (2U)
#define FCM_CLR_OVFCLR                                 (0x00000004UL)

/*******************************************************************************
                Bit definition for Peripheral FMAC
*******************************************************************************/
/*  Bit definition for FMAC_ENR register  */
#define FMAC_ENR_FMACEN                                (0x00000001UL)

/*  Bit definition for FMAC_CTR register  */
#define FMAC_CTR_STAGE_NUM_POS                         (0U)
#define FMAC_CTR_STAGE_NUM                             (0x0000001FUL)
#define FMAC_CTR_SHIFT_POS                             (8U)
#define FMAC_CTR_SHIFT                                 (0x00001F00UL)

/*  Bit definition for FMAC_IER register  */
#define FMAC_IER_INTEN                                 (0x00000001UL)

/*  Bit definition for FMAC_DTR register  */
#define FMAC_DTR_DIN                                   (0x0000FFFFUL)

/*  Bit definition for FMAC_RTR0 register  */
#define FMAC_RTR0                                      (0xFFFFFFFFUL)

/*  Bit definition for FMAC_RTR1 register  */
#define FMAC_RTR1                                      (0xFFFFFFFFUL)

/*  Bit definition for FMAC_STR register  */
#define FMAC_STR_READY_POS                             (31U)
#define FMAC_STR_READY                                 (0x80000000UL)

/*  Bit definition for FMAC_COR0 register  */
#define FMAC_COR0_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR1 register  */
#define FMAC_COR1_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR2 register  */
#define FMAC_COR2_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR3 register  */
#define FMAC_COR3_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR4 register  */
#define FMAC_COR4_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR5 register  */
#define FMAC_COR5_CIN                                  (0x0000FFFFUL)

/*  Bit definition for FMAC_COR6 register  */
#define FMAC_COR6_CIN                                  (0x0000FFFFUL)

