RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
/*  Bit definition for MPU_S1RGRP register  */
#define MPU_S1RGRP_S1RG0RP_POS                         (0U)
#define MPU_S1RGRP_S1RG0RP                             (0x00000001UL)
#define MPU_S1RGRP_S1RG1RP_POS                         (1U)
#define MPU_S1RGRP_S1RG1RP                             (0x00000002UL)
#define MPU_S1RGRP_S1RG2RP_POS                         (2U)
#define MPU_S1RGRP_S1RG2RP                             (0x00000004UL)
#define MPU_S1RGRP_S1RG3RP_POS                         (3U)
#define MPU_S1RGRP_S1RG3RP                             (0x00000008UL)
#define MPU_S1RGRP_S1RG4RP_POS                         (4U)
#define MPU_S1RGRP_S1RG4RP                             (0x00000010UL)
#define MPU_S1RGRP_S1RG5RP_POS                         (5U)
#define MPU_S1RGRP_S1RG5RP                             (0x00000020UL)
#define MPU_S1RGRP_S1RG6RP_POS                         (6U)
#define MPU_S1RGRP_S1RG6RP                             (0x00000040UL)
#define MPU_S1RGRP_S1RG7RP_POS                         (7U)
#define MPU_S1RGRP_S1RG7RP                             (0x00000080UL)
#define MPU_S1RGRP_S1RG8RP_POS                         (8U)
#define MPU_S1RGRP_S1RG8RP                             (0x00000100UL)
#define MPU_S1RGRP_S1RG9RP_POS                         (9U)
#define MPU_S1RGRP_S1RG9RP                             (0x00000200UL)
#define MPU_S1RGRP_S1RG10RP_POS                        (10U)
#define MPU_S1RGRP_S1RG10RP                            (0x00000400UL)
#define MPU_S1RGRP_S1RG11RP_POS                        (11U)
#define MPU_S1RGRP_S1RG11RP                            (0x00000800UL)
#define MPU_S1RGRP_S1RG12RP_POS                        (12U)
#define MPU_S1RGRP_S1RG12RP                            (0x00001000UL)
#define MPU_S1RGRP_S1RG13RP_POS                        (13U)
#define MPU_S1RGRP_S1RG13RP                            (0x00002000UL)
#define MPU_S1RGRP_S1RG14RP_POS                        (14U)
#define MPU_S1RGRP_S1RG14RP                            (0x00004000UL)
#define MPU_S1RGRP_S1RG15RP_POS                        (15U)
#define MPU_S1RGRP_S1RG15RP                            (0x00008000UL)

/*  Bit definition for MPU_S1CR register  */
#define MPU_S1CR_SMPU1BRP_POS                          (0U)
#define MPU_S1CR_SMPU1BRP                              (0x00000001UL)
#define MPU_S1CR_SMPU1BWP_POS                          (1U)
#define MPU_S1CR_SMPU1BWP                              (0x00000002UL)
#define MPU_S1CR_SMPU1ACT_POS                          (2U)
#define MPU_S1CR_SMPU1ACT                              (0x0000000CUL)
#define MPU_S1CR_SMPU1ACT_0                            (0x00000004UL)
#define MPU_S1CR_SMPU1ACT_1                            (0x00000008UL)
#define MPU_S1CR_SMPU1E_POS                            (7U)
#define MPU_S1CR_SMPU1E                                (0x00000080UL)

/*  Bit definition for MPU_S2RGE register  */
#define MPU_S2RGE_S2RG0E_POS                           (0U)
#define MPU_S2RGE_S2RG0E                               (0x00000001UL)
#define MPU_S2RGE_S2RG1E_POS                           (1U)
#define MPU_S2RGE_S2RG1E                               (0x00000002UL)
#define MPU_S2RGE_S2RG2E_POS                           (2U)
#define MPU_S2RGE_S2RG2E                               (0x00000004UL)
#define MPU_S2RGE_S2RG3E_POS                           (3U)
#define MPU_S2RGE_S2RG3E                               (0x00000008UL)
#define MPU_S2RGE_S2RG4E_POS                           (4U)
#define MPU_S2RGE_S2RG4E                               (0x00000010UL)
#define MPU_S2RGE_S2RG5E_POS                           (5U)
#define MPU_S2RGE_S2RG5E                               (0x00000020UL)
#define MPU_S2RGE_S2RG6E_POS                           (6U)
#define MPU_S2RGE_S2RG6E                               (0x00000040UL)
#define MPU_S2RGE_S2RG7E_POS                           (7U)
#define MPU_S2RGE_S2RG7E                               (0x00000080UL)
#define MPU_S2RGE_S2RG8E_POS                           (8U)
#define MPU_S2RGE_S2RG8E                               (0x00000100UL)
#define MPU_S2RGE_S2RG9E_POS                           (9U)
#define MPU_S2RGE_S2RG9E                               (0x00000200UL)
#define MPU_S2RGE_S2RG10E_POS                          (10U)
#define MPU_S2RGE_S2RG10E                              (0x00000400UL)
#define MPU_S2RGE_S2RG11E_POS                          (11U)
#define MPU_S2RGE_S2RG11E                              (0x00000800UL)
#define MPU_S2RGE_S2RG12E_POS                          (12U)
#define MPU_S2RGE_S2RG12E                              (0x00001000UL)
#define MPU_S2RGE_S2RG13E_POS                          (13U)
#define MPU_S2RGE_S2RG13E                              (0x00002000UL)
#define MPU_S2RGE_S2RG14E_POS                          (14U)
#define MPU_S2RGE_S2RG14E                              (0x00004000UL)
#define MPU_S2RGE_S2RG15E_POS                          (15U)
#define MPU_S2RGE_S2RG15E                              (0x00008000UL)

/*  Bit definition for MPU_S2RGWP register  */
#define MPU_S2RGWP_S2RG0WP_POS                         (0U)
#define MPU_S2RGWP_S2RG0WP                             (0x00000001UL)
#define MPU_S2RGWP_S2RG1WP_POS                         (1U)
#define MPU_S2RGWP_S2RG1WP                             (0x00000002UL)
#define MPU_S2RGWP_S2RG2WP_POS                         (2U)
#define MPU_S2RGWP_S2RG2WP                             (0x00000004UL)
#define MPU_S2RGWP_S2RG3WP_POS                         (3U)
#define MPU_S2RGWP_S2RG3WP                             (0x00000008UL)
#define MPU_S2RGWP_S2RG4WP_POS                         (4U)
#define MPU_S2RGWP_S2RG4WP                             (0x00000010UL)
#define MPU_S2RGWP_S2RG5WP_POS                         (5U)
#define MPU_S2RGWP_S2RG5WP                             (0x00000020UL)
#define MPU_S2RGWP_S2RG6WP_POS                         (6U)
#define MPU_S2RGWP_S2RG6WP                             (0x00000040UL)
#define MPU_S2RGWP_S2RG7WP_POS                         (7U)
#define MPU_S2RGWP_S2RG7WP                             (0x00000080UL)
#define MPU_S2RGWP_S2RG8WP_POS                         (8U)
#define MPU_S2RGWP_S2RG8WP                             (0x00000100UL)
#define MPU_S2RGWP_S2RG9WP_POS                         (9U)
#define MPU_S2RGWP_S2RG9WP                             (0x00000200UL)
#define MPU_S2RGWP_S2RG10WP_POS                        (10U)
#define MPU_S2RGWP_S2RG10WP                            (0x00000400UL)
#define MPU_S2RGWP_S2RG11WP_POS                        (11U)
#define MPU_S2RGWP_S2RG11WP                            (0x00000800UL)
#define MPU_S2RGWP_S2RG12WP_POS                        (12U)
#define MPU_S2RGWP_S2RG12WP                            (0x00001000UL)
#define MPU_S2RGWP_S2RG13WP_POS                        (13U)
#define MPU_S2RGWP_S2RG13WP                            (0x00002000UL)
#define MPU_S2RGWP_S2RG14WP_POS                        (14U)
#define MPU_S2RGWP_S2RG14WP                            (0x00004000UL)
#define MPU_S2RGWP_S2RG15WP_POS                        (15U)
#define MPU_S2RGWP_S2RG15WP                            (0x00008000UL)

/*  Bit definition for MPU_S2RGRP register  */
#define MPU_S2RGRP_S2RG0RP_POS                         (0U)
#define MPU_S2RGRP_S2RG0RP                             (0x00000001UL)
#define MPU_S2RGRP_S2RG1RP_POS                         (1U)
#define MPU_S2RGRP_S2RG1RP                             (0x00000002UL)
#define MPU_S2RGRP_S2RG2RP_POS                         (2U)
#define MPU_S2RGRP_S2RG2RP                             (0x00000004UL)
#define MPU_S2RGRP_S2RG3RP_POS                         (3U)
#define MPU_S2RGRP_S2RG3RP                             (0x00000008UL)
#define MPU_S2RGRP_S2RG4RP_POS                         (4U)
#define MPU_S2RGRP_S2RG4RP                             (0x00000010UL)
#define MPU_S2RGRP_S2RG5RP_POS                         (5U)
#define MPU_S2RGRP_S2RG5RP                             (0x00000020UL)
#define MPU_S2RGRP_S2RG6RP_POS                         (6U)
#define MPU_S2RGRP_S2RG6RP                             (0x00000040UL)
#define MPU_S2RGRP_S2RG7RP_POS                         (7U)
#define MPU_S2RGRP_S2RG7RP                             (0x00000080UL)
#define MPU_S2RGRP_S2RG8RP_POS                         (8U)
#define MPU_S2RGRP_S2RG8RP                             (0x00000100UL)
#define MPU_S2RGRP_S2RG9RP_POS                         (9U)
#define MPU_S2RGRP_S2RG9RP                             (0x00000200UL)
#define MPU_S2RGRP_S2RG10RP_POS                        (10U)
#define MPU_S2RGRP_S2RG10RP                            (0x00000400UL)
#define MPU_S2RGRP_S2RG11RP_POS                        (11U)
#define MPU_S2RGRP_S2RG11RP                            (0x00000800UL)
#define MPU_S2RGRP_S2RG12RP_POS                        (12U)
#define MPU_S2RGRP_S2RG12RP                            (0x00001000UL)
#define MPU_S2RGRP_S2RG13RP_POS                        (13U)
#define MPU_S2RGRP_S2RG13RP                            (0x00002000UL)
#define MPU_S2RGRP_S2RG14RP_POS                        (14U)
#define MPU_S2RGRP_S2RG14RP                            (0x00004000UL)
#define MPU_S2RGRP_S2RG15RP_POS                        (15U)
#define MPU_S2RGRP_S2RG15RP                            (0x00008000UL)

