RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
/*  Bit definition for USBHS_GRXFSIZ register  */
#define USBHS_GRXFSIZ_RXFD                             (0x00000FFFUL)

/*  Bit definition for USBHS_HNPTXFSIZ register  */
#define USBHS_HNPTXFSIZ_NPTXFSA_POS                    (0U)
#define USBHS_HNPTXFSIZ_NPTXFSA                        (0x0000FFFFUL)
#define USBHS_HNPTXFSIZ_NPTXFD_POS                     (16U)
#define USBHS_HNPTXFSIZ_NPTXFD                         (0xFFFF0000UL)

/*  Bit definition for USBHS_HNPTXSTS register  */
#define USBHS_HNPTXSTS_NPTXFSAV_POS                    (0U)
#define USBHS_HNPTXSTS_NPTXFSAV                        (0x0000FFFFUL)
#define USBHS_HNPTXSTS_NPTQXSAV_POS                    (16U)
#define USBHS_HNPTXSTS_NPTQXSAV                        (0x00FF0000UL)
#define USBHS_HNPTXSTS_NPTXQTOP_POS                    (24U)
#define USBHS_HNPTXSTS_NPTXQTOP                        (0x7F000000UL)

/*  Bit definition for USBHS_CID register  */
#define USBHS_CID                                      (0xFFFFFFFFUL)

/*  Bit definition for USBHS_GLPMCFG register  */
#define USBHS_GLPMCFG_LPMEN_POS                        (0U)
#define USBHS_GLPMCFG_LPMEN                            (0x00000001UL)
#define USBHS_GLPMCFG_LPMACK_POS                       (1U)
#define USBHS_GLPMCFG_LPMACK                           (0x00000002UL)
#define USBHS_GLPMCFG_BSEL_POS                         (2U)
#define USBHS_GLPMCFG_BSEL                             (0x0000003CUL)
#define USBHS_GLPMCFG_REMWAKE_POS                      (6U)
#define USBHS_GLPMCFG_REMWAKE                          (0x00000040UL)
#define USBHS_GLPMCFG_L1SSEN_POS                       (7U)
#define USBHS_GLPMCFG_L1SSEN                           (0x00000080UL)
#define USBHS_GLPMCFG_BESLTHRS_POS                     (8U)
#define USBHS_GLPMCFG_BESLTHRS                         (0x00000F00UL)
#define USBHS_GLPMCFG_L1DSEN_POS                       (12U)
#define USBHS_GLPMCFG_L1DSEN                           (0x00001000UL)
#define USBHS_GLPMCFG_LPMRSP_POS                       (13U)
#define USBHS_GLPMCFG_LPMRSP                           (0x00006000UL)
#define USBHS_GLPMCFG_SLPSTS_POS                       (15U)
#define USBHS_GLPMCFG_SLPSTS                           (0x00008000UL)
#define USBHS_GLPMCFG_L1RSMOK_POS                      (16U)
#define USBHS_GLPMCFG_L1RSMOK                          (0x00010000UL)
#define USBHS_GLPMCFG_LPMCHIDX_POS                     (17U)
#define USBHS_GLPMCFG_LPMCHIDX                         (0x001E0000UL)
#define USBHS_GLPMCFG_LPMRCNT_POS                      (21U)
#define USBHS_GLPMCFG_LPMRCNT                          (0x00E00000UL)
#define USBHS_GLPMCFG_SENDLPM_POS                      (24U)
#define USBHS_GLPMCFG_SENDLPM                          (0x01000000UL)
#define USBHS_GLPMCFG_LPMRCNTSTS_POS                   (25U)
#define USBHS_GLPMCFG_LPMRCNTSTS                       (0x0E000000UL)
#define USBHS_GLPMCFG_ENBSEL_POS                       (28U)
#define USBHS_GLPMCFG_ENBSEL                           (0x10000000UL)

/*  Bit definition for USBHS_HPTXFSIZ register  */
#define USBHS_HPTXFSIZ_PTXSA_POS                       (0U)
#define USBHS_HPTXFSIZ_PTXSA                           (0x0000FFFFUL)
#define USBHS_HPTXFSIZ_PTXFD_POS                       (16U)
#define USBHS_HPTXFSIZ_PTXFD                           (0xFFFF0000UL)

/*  Bit definition for USBHS_DIEPTXF register  */
#define USBHS_DIEPTXF_INEPTXSA_POS                     (0U)
#define USBHS_DIEPTXF_INEPTXSA                         (0x0000FFFFUL)
#define USBHS_DIEPTXF_INEPTXFD_POS                     (16U)
#define USBHS_DIEPTXF_INEPTXFD                         (0xFFFF0000UL)

/*  Bit definition for USBHS_HCFG register  */
#define USBHS_HCFG_FSLSPCS_POS                         (0U)
#define USBHS_HCFG_FSLSPCS                             (0x00000003UL)
#define USBHS_HCFG_FSLSS_POS                           (2U)
#define USBHS_HCFG_FSLSS                               (0x00000004UL)

/*  Bit definition for USBHS_HFIR register  */
#define USBHS_HFIR_FRIVL                               (0x0000FFFFUL)

/*  Bit definition for USBHS_HFNUM register  */
#define USBHS_HFNUM_FRNUM_POS                          (0U)
#define USBHS_HFNUM_FRNUM                              (0x0000FFFFUL)
#define USBHS_HFNUM_FTREM_POS                          (16U)
#define USBHS_HFNUM_FTREM                              (0xFFFF0000UL)

/*  Bit definition for USBHS_HPTXSTS register  */
#define USBHS_HPTXSTS_PTXFSAVL_POS                     (0U)
#define USBHS_HPTXSTS_PTXFSAVL                         (0x0000FFFFUL)
#define USBHS_HPTXSTS_PTXQSAV_POS                      (16U)
#define USBHS_HPTXSTS_PTXQSAV                          (0x00FF0000UL)
#define USBHS_HPTXSTS_PTXQTOP_POS                      (24U)
#define USBHS_HPTXSTS_PTXQTOP                          (0xFF000000UL)

/*  Bit definition for USBHS_HAINT register  */
#define USBHS_HAINT_HAINT                              (0x0000FFFFUL)

/*  Bit definition for USBHS_HAINTMSK register  */
#define USBHS_HAINTMSK_HAINTM                          (0x0000FFFFUL)

/*  Bit definition for USBHS_HPRT register  */
#define USBHS_HPRT_PCSTS_POS                           (0U)
#define USBHS_HPRT_PCSTS                               (0x00000001UL)
#define USBHS_HPRT_PCDET_POS                           (1U)
#define USBHS_HPRT_PCDET                               (0x00000002UL)
#define USBHS_HPRT_PENA_POS                            (2U)
#define USBHS_HPRT_PENA                                (0x00000004UL)
#define USBHS_HPRT_PENCHNG_POS                         (3U)
#define USBHS_HPRT_PENCHNG                             (0x00000008UL)
#define USBHS_HPRT_POCA_POS                            (4U)
#define USBHS_HPRT_POCA                                (0x00000010UL)
#define USBHS_HPRT_POCCHNG_POS                         (5U)
#define USBHS_HPRT_POCCHNG                             (0x00000020UL)
#define USBHS_HPRT_PRES_POS                            (6U)
#define USBHS_HPRT_PRES                                (0x00000040UL)
#define USBHS_HPRT_PSUSP_POS                           (7U)
#define USBHS_HPRT_PSUSP                               (0x00000080UL)
#define USBHS_HPRT_PRST_POS                            (8U)
#define USBHS_HPRT_PRST                                (0x00000100UL)
#define USBHS_HPRT_PLSTS_POS                           (10U)
#define USBHS_HPRT_PLSTS                               (0x00000C00UL)
#define USBHS_HPRT_PWPR_POS                            (12U)
#define USBHS_HPRT_PWPR                                (0x00001000UL)
#define USBHS_HPRT_PTCTL_POS                           (13U)
#define USBHS_HPRT_PTCTL                               (0x0001E000UL)
#define USBHS_HPRT_PSPD_POS                            (17U)
#define USBHS_HPRT_PSPD                                (0x00060000UL)

/*  Bit definition for USBHS_HCCHAR register  */
#define USBHS_HCCHAR_MPSIZ_POS                         (0U)
#define USBHS_HCCHAR_MPSIZ                             (0x000007FFUL)
#define USBHS_HCCHAR_EPNUM_POS                         (11U)
#define USBHS_HCCHAR_EPNUM                             (0x00007800UL)
#define USBHS_HCCHAR_EPDIR_POS                         (15U)
#define USBHS_HCCHAR_EPDIR                             (0x00008000UL)
#define USBHS_HCCHAR_LSDEV_POS                         (17U)
#define USBHS_HCCHAR_LSDEV                             (0x00020000UL)
#define USBHS_HCCHAR_EPTYP_POS                         (18U)
#define USBHS_HCCHAR_EPTYP                             (0x000C0000UL)
#define USBHS_HCCHAR_MC_POS                            (20U)
#define USBHS_HCCHAR_MC                                (0x00300000UL)
#define USBHS_HCCHAR_DAD_POS                           (22U)
#define USBHS_HCCHAR_DAD                               (0x1FC00000UL)
#define USBHS_HCCHAR_ODDFRM_POS                        (29U)
#define USBHS_HCCHAR_ODDFRM                            (0x20000000UL)
#define USBHS_HCCHAR_CHDIS_POS                         (30U)
#define USBHS_HCCHAR_CHDIS                             (0x40000000UL)
#define USBHS_HCCHAR_CHENA_POS                         (31U)
#define USBHS_HCCHAR_CHENA                             (0x80000000UL)

/*  Bit definition for USBHS_HCSPLT register  */
#define USBHS_HCSPLT_PRTADDR_POS                       (0U)
#define USBHS_HCSPLT_PRTADDR                           (0x0000007FUL)
#define USBHS_HCSPLT_HUBADDR_POS                       (7U)
#define USBHS_HCSPLT_HUBADDR                           (0x00003F80UL)
#define USBHS_HCSPLT_XACTPOS_POS                       (14U)
#define USBHS_HCSPLT_XACTPOS                           (0x0000C000UL)
#define USBHS_HCSPLT_COMPLSPLT_POS                     (16U)
#define USBHS_HCSPLT_COMPLSPLT                         (0x00010000UL)
#define USBHS_HCSPLT_SPLITEN_POS                       (31U)
#define USBHS_HCSPLT_SPLITEN                           (0x80000000UL)

