RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
typedef struct {
    __IO uint32_t MSKTC0;
    __IO uint32_t MSKTC1;
    __IO uint32_t MSKTC2;
    __IO uint32_t MSKTC3;
    __IO uint32_t MSKTC4;
    __IO uint32_t MSKTC5;
    __IO uint32_t MSKTC6;
    __IO uint32_t MSKTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t MSKBTC0;
    __IO uint32_t MSKBTC1;
    __IO uint32_t MSKBTC2;
    __IO uint32_t MSKBTC3;
    __IO uint32_t MSKBTC4;
    __IO uint32_t MSKBTC5;
    __IO uint32_t MSKBTC6;
    __IO uint32_t MSKBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intmask1_bit_t;

typedef struct {
    __IO uint32_t CLRTRNERR0;
    __IO uint32_t CLRTRNERR1;
    __IO uint32_t CLRTRNERR2;
    __IO uint32_t CLRTRNERR3;
    __IO uint32_t CLRTRNERR4;
    __IO uint32_t CLRTRNERR5;
    __IO uint32_t CLRTRNERR6;
    __IO uint32_t CLRTRNERR7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRREQERR0;
    __IO uint32_t CLRREQERR1;
    __IO uint32_t CLRREQERR2;
    __IO uint32_t CLRREQERR3;
    __IO uint32_t CLRREQERR4;
    __IO uint32_t CLRREQERR5;
    __IO uint32_t CLRREQERR6;
    __IO uint32_t CLRREQERR7;
    uint32_t RESERVED1[8];
} stc_dma_intclr0_bit_t;

typedef struct {
    __IO uint32_t CLRTC0;
    __IO uint32_t CLRTC1;
    __IO uint32_t CLRTC2;
    __IO uint32_t CLRTC3;
    __IO uint32_t CLRTC4;
    __IO uint32_t CLRTC5;
    __IO uint32_t CLRTC6;
    __IO uint32_t CLRTC7;
    uint32_t RESERVED0[8];
    __IO uint32_t CLRBTC0;
    __IO uint32_t CLRBTC1;
    __IO uint32_t CLRBTC2;
    __IO uint32_t CLRBTC3;
    __IO uint32_t CLRBTC4;
    __IO uint32_t CLRBTC5;
    __IO uint32_t CLRBTC6;
    __IO uint32_t CLRBTC7;
    uint32_t RESERVED1[8];
} stc_dma_intclr1_bit_t;

typedef struct {
    __IO uint32_t CHEN0;
    __IO uint32_t CHEN1;
    __IO uint32_t CHEN2;
    __IO uint32_t CHEN3;
    __IO uint32_t CHEN4;
    __IO uint32_t CHEN5;
    __IO uint32_t CHEN6;
    __IO uint32_t CHEN7;
    uint32_t RESERVED0[24];
} stc_dma_chen_bit_t;

typedef struct {
    __I  uint32_t CHREQ0;
    __I  uint32_t CHREQ1;
    __I  uint32_t CHREQ2;
    __I  uint32_t CHREQ3;
    __I  uint32_t CHREQ4;
    __I  uint32_t CHREQ5;
    __I  uint32_t CHREQ6;
    __I  uint32_t CHREQ7;
    uint32_t RESERVED0[7];
    __I  uint32_t RCFGREQ;
    uint32_t RESERVED1[16];
} stc_dma_reqstat_bit_t;

typedef struct {
    __I  uint32_t DMAACT;
    __I  uint32_t RCFGACT;
    uint32_t RESERVED0[14];
    __I  uint32_t CHACT0;
    __I  uint32_t CHACT1;
    __I  uint32_t CHACT2;
    __I  uint32_t CHACT3;
    __I  uint32_t CHACT4;
    __I  uint32_t CHACT5;
    __I  uint32_t CHACT6;
    __I  uint32_t CHACT7;
    uint32_t RESERVED1[8];
} stc_dma_chstat_bit_t;

typedef struct {
    __IO uint32_t RCFGEN;
    __IO uint32_t RCFGLLP;
    uint32_t RESERVED0[14];
    __IO uint32_t SARMD0;
    __IO uint32_t SARMD1;
    __IO uint32_t DARMD0;
    __IO uint32_t DARMD1;
    __IO uint32_t CNTMD0;
    __IO uint32_t CNTMD1;
    uint32_t RESERVED1[10];
} stc_dma_rcfgctl_bit_t;

typedef struct {
    __IO uint32_t CHENCLR0;
    __IO uint32_t CHENCLR1;
    __IO uint32_t CHENCLR2;
    __IO uint32_t CHENCLR3;
    __IO uint32_t CHENCLR4;
    __IO uint32_t CHENCLR5;
    __IO uint32_t CHENCLR6;
    __IO uint32_t CHENCLR7;
    uint32_t RESERVED0[24];
} stc_dma_chenclr_bit_t;

typedef struct {
    __IO uint32_t SINC0;
    __IO uint32_t SINC1;
    __IO uint32_t DINC0;
    __IO uint32_t DINC1;
    __IO uint32_t SRPTEN;
    __IO uint32_t DRPTEN;
    __IO uint32_t SNSEQEN;
    __IO uint32_t DNSEQEN;
    __IO uint32_t HSIZE0;
    __IO uint32_t HSIZE1;
    __IO uint32_t LLPEN;
    __IO uint32_t LLPRUN;
    __IO uint32_t IE;
    uint32_t RESERVED0[19];
} stc_dma_chctl_bit_t;

typedef struct {
    __IO uint32_t CAPEN;
    __IO uint32_t CAPMD;
    __IO uint32_t CROPEN;
    __IO uint32_t JPEGEN;
    __IO uint32_t SWSYNC;
    __IO uint32_t PIXCKSEL;
    __IO uint32_t HSYNCSEL;
    __IO uint32_t VSYNCSEL;
    __IO uint32_t CAPFRC0;
    __IO uint32_t CAPFRC1;
    __IO uint32_t BITSEL0;
    __IO uint32_t BITSEL1;
    uint32_t RESERVED0[2];
    __IO uint32_t DVPEN;
    uint32_t RESERVED1[17];
} stc_dvp_ctr_bit_t;

typedef struct {
    __IO uint32_t FSF;
    __IO uint32_t LSF;
    __IO uint32_t LEF;
    __IO uint32_t FEF;
    __IO uint32_t SQUERF;
    __IO uint32_t FIFOERF;
    uint32_t RESERVED0[26];
} stc_dvp_str_bit_t;

typedef struct {
    __IO uint32_t FSIEN;
    __IO uint32_t LSIEN;
    __IO uint32_t LEIEN;
    __IO uint32_t FEIEN;
    __IO uint32_t SQUERIEN;
    __IO uint32_t FIFOERIEN;
    uint32_t RESERVED0[26];
} stc_dvp_ier_bit_t;

typedef struct {
    __IO uint32_t F0STP;
    __IO uint32_t F1STP;
    uint32_t RESERVED0[30];
} stc_efm_fstp_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t LVM;
    uint32_t RESERVED1[7];
    __IO uint32_t ICACHE;
    __IO uint32_t DCACHE;
    __IO uint32_t PREFETE;
    __IO uint32_t CRST;
    uint32_t RESERVED2[12];
} stc_efm_frmc_bit_t;

typedef struct {
    uint32_t RESERVED0[8];
    __IO uint32_t BUSHLDCTL;
    uint32_t RESERVED1[7];
    __IO uint32_t KEY1LOCK;
    __IO uint32_t KEY2LOCK;
    uint32_t RESERVED2[14];
} stc_efm_fwmc_bit_t;

typedef struct {
    __I  uint32_t OTPWERR0;
    __I  uint32_t PRTWERR0;
    __I  uint32_t PGSZERR0;
    __I  uint32_t MISMTCH0;
    __I  uint32_t OPTEND0;
    __I  uint32_t COLERR0;
    uint32_t RESERVED0[2];
    __I  uint32_t RDY0;
    uint32_t RESERVED1[8];
    __I  uint32_t PRTWERR1;
    __I  uint32_t PGSZERR1;
    __I  uint32_t MISMTCH1;
    __I  uint32_t OPTEND1;
    __I  uint32_t COLERR1;
    uint32_t RESERVED2[2];
    __I  uint32_t RDY1;
    uint32_t RESERVED3[7];
} stc_efm_fsr_bit_t;

typedef struct {
    __IO uint32_t OTPWERRCLR0;
    __IO uint32_t PRTWERRCLR0;
    __IO uint32_t PGSZERRCLR0;
    __IO uint32_t MISMTCHCLR0;
    __IO uint32_t OPTENDCLR0;
    __IO uint32_t COLERRCLR0;
    uint32_t RESERVED0[11];
    __IO uint32_t PRTWERRCLR1;
    __IO uint32_t PGSZERRCLR1;
    __IO uint32_t MISMTCHCLR1;
    __IO uint32_t OPTENDCLR1;
    __IO uint32_t COLERRCLR1;
    uint32_t RESERVED1[10];
} stc_efm_fsclr_bit_t;

typedef struct {
    __IO uint32_t PEERRITE;
    __IO uint32_t OPTENDITE;
    __IO uint32_t COLERRITE;
    uint32_t RESERVED0[29];
} stc_efm_fite_bit_t;

