RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
typedef struct {
    __IO uint32_t KEYINSEL0;
    __IO uint32_t KEYINSEL1;
    __IO uint32_t KEYINSEL2;
    __IO uint32_t KEYINSEL3;
    __IO uint32_t KEYINSEL4;
    __IO uint32_t KEYINSEL5;
    __IO uint32_t KEYINSEL6;
    __IO uint32_t KEYINSEL7;
    __IO uint32_t KEYINSEL8;
    __IO uint32_t KEYINSEL9;
    __IO uint32_t KEYINSEL10;
    __IO uint32_t KEYINSEL11;
    __IO uint32_t KEYINSEL12;
    __IO uint32_t KEYINSEL13;
    __IO uint32_t KEYINSEL14;
    __IO uint32_t KEYINSEL15;
    uint32_t RESERVED0[4];
    __IO uint32_t CKSEL0;
    __IO uint32_t CKSEL1;
    uint32_t RESERVED1[10];
} stc_keyscan_scr_bit_t;

typedef struct {
    __IO uint32_t SEN;
    uint32_t RESERVED0[31];
} stc_keyscan_ser_bit_t;

typedef struct {
    __IO uint32_t START;
    __IO uint32_t INTEN;
    uint32_t RESERVED0[1];
    __IO uint32_t BUSY;
    uint32_t RESERVED1[28];
} stc_mau_csr_bit_t;

typedef struct {
    __IO uint32_t MPURGSIZE0;
    __IO uint32_t MPURGSIZE1;
    __IO uint32_t MPURGSIZE2;
    __IO uint32_t MPURGSIZE3;
    __IO uint32_t MPURGSIZE4;
    uint32_t RESERVED0[27];
} stc_mpu_rgd_bit_t;

typedef struct {
    __I  uint32_t SMPU1EAF;
    __I  uint32_t SMPU2EAF;
    __I  uint32_t FMPUEAF;
    __I  uint32_t HMPUEAF;
    __I  uint32_t EMPUEAF;
    uint32_t RESERVED0[27];
} stc_mpu_sr_bit_t;

typedef struct {
    __O  uint32_t SMPU1ECLR;
    __O  uint32_t SMPU2ECLR;
    __O  uint32_t FMPUECLR;
    __O  uint32_t HMPUECLR;
    __O  uint32_t EMPUECLR;
    uint32_t RESERVED0[27];
} stc_mpu_eclr_bit_t;

typedef struct {
    __IO uint32_t MPUWE;
    uint32_t RESERVED0[31];
} stc_mpu_wp_bit_t;

typedef struct {
    __IO uint32_t AESRDP;
    __IO uint32_t AESWRP;
    __IO uint32_t HASHRDP;
    __IO uint32_t HASHWRP;
    __IO uint32_t TRNGRDP;
    __IO uint32_t TRNGWRP;
    __IO uint32_t CRCRDP;
    __IO uint32_t CRCWRP;
    __IO uint32_t EFMRDP;
    __IO uint32_t EFMWRP;
    uint32_t RESERVED0[2];
    __IO uint32_t WDTRDP;
    __IO uint32_t WDTWRP;
    __IO uint32_t SWDTRDP;
    __IO uint32_t SWDTWRP;
    __IO uint32_t BKSRAMRDP;
    __IO uint32_t BKSRAMWRP;
    __IO uint32_t RTCRDP;
    __IO uint32_t RTCWRP;
    __IO uint32_t DMPURDP;
    __IO uint32_t DMPUWRP;
    __IO uint32_t SRAMCRDP;
    __IO uint32_t SRAMCWRP;
    __IO uint32_t INTCRDP;
    __IO uint32_t INTCWRP;
    __IO uint32_t SYSCRDP;
    __IO uint32_t SYSCWRP;
    __IO uint32_t MSTPRDP;
    __IO uint32_t MSPTWRP;
    uint32_t RESERVED1[1];
    __IO uint32_t BUSERRE;
} stc_mpu_ippr_bit_t;

typedef struct {
    __IO uint32_t S1RG0E;
    __IO uint32_t S1RG1E;
    __IO uint32_t S1RG2E;
    __IO uint32_t S1RG3E;
    __IO uint32_t S1RG4E;
    __IO uint32_t S1RG5E;
    __IO uint32_t S1RG6E;
    __IO uint32_t S1RG7E;
    __IO uint32_t S1RG8E;
    __IO uint32_t S1RG9E;
    __IO uint32_t S1RG10E;
    __IO uint32_t S1RG11E;
    __IO uint32_t S1RG12E;
    __IO uint32_t S1RG13E;
    __IO uint32_t S1RG14E;
    __IO uint32_t S1RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s1rge_bit_t;

typedef struct {
    __IO uint32_t S1RG0WP;
    __IO uint32_t S1RG1WP;
    __IO uint32_t S1RG2WP;
    __IO uint32_t S1RG3WP;
    __IO uint32_t S1RG4WP;
    __IO uint32_t S1RG5WP;
    __IO uint32_t S1RG6WP;
    __IO uint32_t S1RG7WP;
    __IO uint32_t S1RG8WP;
    __IO uint32_t S1RG9WP;
    __IO uint32_t S1RG10WP;
    __IO uint32_t S1RG11WP;
    __IO uint32_t S1RG12WP;
    __IO uint32_t S1RG13WP;
    __IO uint32_t S1RG14WP;
    __IO uint32_t S1RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgwp_bit_t;

typedef struct {
    __IO uint32_t S1RG0RP;
    __IO uint32_t S1RG1RP;
    __IO uint32_t S1RG2RP;
    __IO uint32_t S1RG3RP;
    __IO uint32_t S1RG4RP;
    __IO uint32_t S1RG5RP;
    __IO uint32_t S1RG6RP;
    __IO uint32_t S1RG7RP;
    __IO uint32_t S1RG8RP;
    __IO uint32_t S1RG9RP;
    __IO uint32_t S1RG10RP;
    __IO uint32_t S1RG11RP;
    __IO uint32_t S1RG12RP;
    __IO uint32_t S1RG13RP;
    __IO uint32_t S1RG14RP;
    __IO uint32_t S1RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s1rgrp_bit_t;

typedef struct {
    __IO uint32_t SMPU1BRP;
    __IO uint32_t SMPU1BWP;
    __IO uint32_t SMPU1ACT0;
    __IO uint32_t SMPU1ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU1E;
    uint32_t RESERVED1[24];
} stc_mpu_s1cr_bit_t;

typedef struct {
    __IO uint32_t S2RG0E;
    __IO uint32_t S2RG1E;
    __IO uint32_t S2RG2E;
    __IO uint32_t S2RG3E;
    __IO uint32_t S2RG4E;
    __IO uint32_t S2RG5E;
    __IO uint32_t S2RG6E;
    __IO uint32_t S2RG7E;
    __IO uint32_t S2RG8E;
    __IO uint32_t S2RG9E;
    __IO uint32_t S2RG10E;
    __IO uint32_t S2RG11E;
    __IO uint32_t S2RG12E;
    __IO uint32_t S2RG13E;
    __IO uint32_t S2RG14E;
    __IO uint32_t S2RG15E;
    uint32_t RESERVED0[16];
} stc_mpu_s2rge_bit_t;

typedef struct {
    __IO uint32_t S2RG0WP;
    __IO uint32_t S2RG1WP;
    __IO uint32_t S2RG2WP;
    __IO uint32_t S2RG3WP;
    __IO uint32_t S2RG4WP;
    __IO uint32_t S2RG5WP;
    __IO uint32_t S2RG6WP;
    __IO uint32_t S2RG7WP;
    __IO uint32_t S2RG8WP;
    __IO uint32_t S2RG9WP;
    __IO uint32_t S2RG10WP;
    __IO uint32_t S2RG11WP;
    __IO uint32_t S2RG12WP;
    __IO uint32_t S2RG13WP;
    __IO uint32_t S2RG14WP;
    __IO uint32_t S2RG15WP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgwp_bit_t;

typedef struct {
    __IO uint32_t S2RG0RP;
    __IO uint32_t S2RG1RP;
    __IO uint32_t S2RG2RP;
    __IO uint32_t S2RG3RP;
    __IO uint32_t S2RG4RP;
    __IO uint32_t S2RG5RP;
    __IO uint32_t S2RG6RP;
    __IO uint32_t S2RG7RP;
    __IO uint32_t S2RG8RP;
    __IO uint32_t S2RG9RP;
    __IO uint32_t S2RG10RP;
    __IO uint32_t S2RG11RP;
    __IO uint32_t S2RG12RP;
    __IO uint32_t S2RG13RP;
    __IO uint32_t S2RG14RP;
    __IO uint32_t S2RG15RP;
    uint32_t RESERVED0[16];
} stc_mpu_s2rgrp_bit_t;

typedef struct {
    __IO uint32_t SMPU2BRP;
    __IO uint32_t SMPU2BWP;
    __IO uint32_t SMPU2ACT0;
    __IO uint32_t SMPU2ACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t SMPU2E;
    uint32_t RESERVED1[24];
} stc_mpu_s2cr_bit_t;

typedef struct {
    __IO uint32_t FRG0E;
    __IO uint32_t FRG1E;
    __IO uint32_t FRG2E;
    __IO uint32_t FRG3E;
    __IO uint32_t FRG4E;
    __IO uint32_t FRG5E;
    __IO uint32_t FRG6E;
    __IO uint32_t FRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_frge_bit_t;

