RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
typedef struct {
    __IO uint32_t FRG0WP;
    __IO uint32_t FRG1WP;
    __IO uint32_t FRG2WP;
    __IO uint32_t FRG3WP;
    __IO uint32_t FRG4WP;
    __IO uint32_t FRG5WP;
    __IO uint32_t FRG6WP;
    __IO uint32_t FRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_frgwp_bit_t;

typedef struct {
    __IO uint32_t FRG0RP;
    __IO uint32_t FRG1RP;
    __IO uint32_t FRG2RP;
    __IO uint32_t FRG3RP;
    __IO uint32_t FRG4RP;
    __IO uint32_t FRG5RP;
    __IO uint32_t FRG6RP;
    __IO uint32_t FRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_frgrp_bit_t;

typedef struct {
    __IO uint32_t FMPUBRP;
    __IO uint32_t FMPUBWP;
    __IO uint32_t FMPUACT0;
    __IO uint32_t FMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t FMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_fcr_bit_t;

typedef struct {
    __IO uint32_t HRG0E;
    __IO uint32_t HRG1E;
    __IO uint32_t HRG2E;
    __IO uint32_t HRG3E;
    __IO uint32_t HRG4E;
    __IO uint32_t HRG5E;
    __IO uint32_t HRG6E;
    __IO uint32_t HRG7E;
    uint32_t RESERVED0[24];
} stc_mpu_hrge_bit_t;

typedef struct {
    __IO uint32_t HRG0WP;
    __IO uint32_t HRG1WP;
    __IO uint32_t HRG2WP;
    __IO uint32_t HRG3WP;
    __IO uint32_t HRG4WP;
    __IO uint32_t HRG5WP;
    __IO uint32_t HRG6WP;
    __IO uint32_t HRG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgwp_bit_t;

typedef struct {
    __IO uint32_t HRG0RP;
    __IO uint32_t HRG1RP;
    __IO uint32_t HRG2RP;
    __IO uint32_t HRG3RP;
    __IO uint32_t HRG4RP;
    __IO uint32_t HRG5RP;
    __IO uint32_t HRG6RP;
    __IO uint32_t HRG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_hrgrp_bit_t;

typedef struct {
    __IO uint32_t HMPUBRP;
    __IO uint32_t HMPUBWP;
    __IO uint32_t HMPUACT0;
    __IO uint32_t HMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t HMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_hcr_bit_t;

typedef struct {
    __IO uint32_t ERG0E;
    __IO uint32_t ERG1E;
    __IO uint32_t ERG2E;
    __IO uint32_t ERG3E;
    __IO uint32_t ERG4E;
    __IO uint32_t ERG5E;
    __IO uint32_t ERG6E;
    __IO uint32_t ERG7E;
    uint32_t RESERVED0[24];
} stc_mpu_erge_bit_t;

typedef struct {
    __IO uint32_t ERG0WP;
    __IO uint32_t ERG1WP;
    __IO uint32_t ERG2WP;
    __IO uint32_t ERG3WP;
    __IO uint32_t ERG4WP;
    __IO uint32_t ERG5WP;
    __IO uint32_t ERG6WP;
    __IO uint32_t ERG7WP;
    uint32_t RESERVED0[24];
} stc_mpu_ergwp_bit_t;

typedef struct {
    __IO uint32_t ERG0RP;
    __IO uint32_t ERG1RP;
    __IO uint32_t ERG2RP;
    __IO uint32_t ERG3RP;
    __IO uint32_t ERG4RP;
    __IO uint32_t ERG5RP;
    __IO uint32_t ERG6RP;
    __IO uint32_t ERG7RP;
    uint32_t RESERVED0[24];
} stc_mpu_ergrp_bit_t;

typedef struct {
    __IO uint32_t EMPUBRP;
    __IO uint32_t EMPUBWP;
    __IO uint32_t EMPUACT0;
    __IO uint32_t EMPUACT1;
    uint32_t RESERVED0[3];
    __IO uint32_t EMPUE;
    uint32_t RESERVED1[24];
} stc_mpu_ecr_bit_t;

typedef struct {
    __IO uint32_t OTSST;
    __IO uint32_t OTSCK;
    __IO uint32_t OTSIE;
    __IO uint32_t TSSTP;
    uint32_t RESERVED0[12];
} stc_ots_ctl_bit_t;

typedef struct {
    __IO uint32_t USBFS_DFB;
    __IO uint32_t USBFS_SOFEN;
    uint32_t RESERVED0[6];
    __IO uint32_t USBHS_DFB;
    __IO uint32_t USBHS_SOFEN;
    __IO uint32_t USBHS_FSPHYE;
    uint32_t RESERVED1[5];
    __IO uint32_t USBFS_NFS0;
    __IO uint32_t USBFS_NFS1;
    __IO uint32_t USBFS_NFE;
    uint32_t RESERVED2[5];
    __IO uint32_t USBHS_NFS0;
    __IO uint32_t USBHS_NFS1;
    __IO uint32_t USBHS_NFE;
    uint32_t RESERVED3[5];
} stc_peric_usb_syctlreg_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t SELMMC1;
    uint32_t RESERVED1[1];
    __IO uint32_t SELMMC2;
    uint32_t RESERVED2[28];
} stc_peric_sdioc_syctlreg_bit_t;

typedef struct {
    __IO uint32_t OPENP;
    uint32_t RESERVED0[31];
} stc_peric_nfc_stcr_bit_t;

typedef struct {
    uint32_t RESERVED0[2];
    __IO uint32_t NFCEN;
    uint32_t RESERVED1[29];
} stc_peric_nfc_enar_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t SMCEN;
    uint32_t RESERVED1[30];
} stc_peric_smc_enar_bit_t;

typedef struct {
    __IO uint32_t DMCEN;
    uint32_t RESERVED0[31];
} stc_peric_dmc_enar_bit_t;

typedef struct {
    __IO uint32_t USASRT1_NFS0;
    __IO uint32_t USASRT1_NFS1;
    __IO uint32_t USART1_NFE;
    uint32_t RESERVED0[29];
} stc_peric_usart1_nfc_bit_t;

typedef struct {
    __I  uint32_t CHIP_BUSY0;
    __I  uint32_t CHIP_BUSY1;
    __I  uint32_t CHIP_BUSY2;
    __I  uint32_t CHIP_BUSY3;
    __I  uint32_t CHIP_BUSY4;
    __I  uint32_t CHIP_BUSY5;
    __I  uint32_t CHIP_BUSY6;
    __I  uint32_t CHIP_BUSY7;
    __I  uint32_t PECC;
    uint32_t RESERVED0[23];
} stc_peric_nfc_stsr_bit_t;

typedef struct {
    __IO uint32_t SRAMH;
    uint32_t RESERVED0[3];
    __IO uint32_t SRAM1;
    __IO uint32_t SRAM2;
    __IO uint32_t SRAM3;
    __IO uint32_t SRAM4;
    uint32_t RESERVED1[2];
    __IO uint32_t SRAMB;
    uint32_t RESERVED2[2];
    __IO uint32_t KEY;
    __IO uint32_t DMA1;
    __IO uint32_t DMA2;
    __IO uint32_t FCM;
    __IO uint32_t AOS;
    __IO uint32_t CTC;
    __IO uint32_t MAU;
    __IO uint32_t AES;
    __IO uint32_t HASH;
    __IO uint32_t TRNG;
    __IO uint32_t CRC;
    __IO uint32_t DCU1;
    __IO uint32_t DCU2;
    __IO uint32_t DCU3;
    __IO uint32_t DCU4;
    __IO uint32_t DCU5;
    __IO uint32_t DCU6;
    __IO uint32_t DCU7;
    __IO uint32_t DCU8;
} stc_pwc_fcg0_bit_t;

typedef struct {
    __IO uint32_t CAN1;
    __IO uint32_t CAN2;
    __IO uint32_t ETHMAC;
    __IO uint32_t QSPI;
    __IO uint32_t I2C1;
    __IO uint32_t I2C2;
    __IO uint32_t I2C3;
    __IO uint32_t I2C4;
    __IO uint32_t I2C5;
    __IO uint32_t I2C6;
    __IO uint32_t SDIOC1;
    __IO uint32_t SDIOC2;
    __IO uint32_t I2S1;
    __IO uint32_t I2S2;
    __IO uint32_t I2S3;
    __IO uint32_t I2S4;
    __IO uint32_t SPI1;
    __IO uint32_t SPI2;
    __IO uint32_t SPI3;
    __IO uint32_t SPI4;
    __IO uint32_t SPI5;
    __IO uint32_t SPI6;
    __IO uint32_t USBFS;
    __IO uint32_t USBHS;
    __IO uint32_t FMAC1;
    __IO uint32_t FMAC2;
    __IO uint32_t FMAC3;
    __IO uint32_t FMAC4;
    uint32_t RESERVED0[4];
} stc_pwc_fcg1_bit_t;

