RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
typedef struct {
    __IO uint32_t TMR6_1;
    __IO uint32_t TMR6_2;
    __IO uint32_t TMR6_3;
    __IO uint32_t TMR6_4;
    __IO uint32_t TMR6_5;
    __IO uint32_t TMR6_6;
    __IO uint32_t TMR6_7;
    __IO uint32_t TMR6_8;
    __IO uint32_t TMR4_1;
    __IO uint32_t TMR4_2;
    __IO uint32_t TMR4_3;
    __IO uint32_t HRPWM;
    __IO uint32_t TMR0_1;
    __IO uint32_t TMR0_2;
    uint32_t RESERVED0[1];
    __IO uint32_t EMB;
    __IO uint32_t TMR2_1;
    __IO uint32_t TMR2_2;
    __IO uint32_t TMR2_3;
    __IO uint32_t TMR2_4;
    __IO uint32_t TMRA_1;
    __IO uint32_t TMRA_2;
    __IO uint32_t TMRA_3;
    __IO uint32_t TMRA_4;
    __IO uint32_t TMRA_5;
    __IO uint32_t TMRA_6;
    __IO uint32_t TMRA_7;
    __IO uint32_t TMRA_8;
    __IO uint32_t TMRA_9;
    __IO uint32_t TMRA_10;
    __IO uint32_t TMRA_11;
    __IO uint32_t TMRA_12;
} stc_pwc_fcg2_bit_t;

typedef struct {
    __IO uint32_t ADC1;
    __IO uint32_t ADC2;
    __IO uint32_t ADC3;
    __IO uint32_t CMBIAS;
    __IO uint32_t DAC1;
    __IO uint32_t DAC2;
    uint32_t RESERVED0[2];
    __IO uint32_t CMP1;
    __IO uint32_t CMP2;
    uint32_t RESERVED1[2];
    __IO uint32_t OTS;
    uint32_t RESERVED2[2];
    __IO uint32_t DVP;
    __IO uint32_t SMC;
    __IO uint32_t DMC;
    __IO uint32_t NFC;
    uint32_t RESERVED3[1];
    __IO uint32_t USART1;
    __IO uint32_t USART2;
    __IO uint32_t USART3;
    __IO uint32_t USART4;
    __IO uint32_t USART5;
    __IO uint32_t USART6;
    __IO uint32_t USART7;
    __IO uint32_t USART8;
    __IO uint32_t USART9;
    __IO uint32_t USART10;
    uint32_t RESERVED4[2];
} stc_pwc_fcg3_bit_t;

typedef struct {
    __IO uint32_t PRT0;
    uint32_t RESERVED0[31];
} stc_pwc_fcg0pc_bit_t;

typedef struct {
    __IO uint32_t VBTRSD;
    __IO uint32_t RAMVALID;
    __IO uint32_t RAMPDF;
    __IO uint32_t VBATDIVMONE;
    uint32_t RESERVED0[3];
    __IO uint32_t CSDIS;
} stc_pwc_vbatcr_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t WKOVF;
    __IO uint32_t WKCKS0;
    __IO uint32_t WKCKS1;
    __IO uint32_t WKTCE;
} stc_pwc_wktc2_bit_t;

typedef struct {
    __IO uint32_t PDMDS0;
    __IO uint32_t PDMDS1;
    uint32_t RESERVED0[2];
    __IO uint32_t IORTN0;
    __IO uint32_t IORTN1;
    uint32_t RESERVED1[1];
    __IO uint32_t PWDN;
} stc_pwc_pwrc0_bit_t;

typedef struct {
    __IO uint32_t VPLLSD0;
    __IO uint32_t VPLLSD1;
    __IO uint32_t VHRCSD;
    __IO uint32_t PDTS;
    uint32_t RESERVED0[2];
    __IO uint32_t STPDAS0;
    __IO uint32_t STPDAS1;
} stc_pwc_pwrc1_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t DVS0;
    __IO uint32_t DVS1;
    uint32_t RESERVED1[2];
} stc_pwc_pwrc2_bit_t;

typedef struct {
    __IO uint32_t VBATREFSEL;
    __IO uint32_t VBATME;
    uint32_t RESERVED0[2];
    __IO uint32_t VBATMON;
    uint32_t RESERVED1[1];
    __IO uint32_t ADBUFS;
    __IO uint32_t ADBUFE;
} stc_pwc_pwrc4_bit_t;

typedef struct {
    __IO uint32_t EXVCCINEN;
    uint32_t RESERVED0[4];
    __IO uint32_t PVD1EN;
    __IO uint32_t PVD2EN;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr0_bit_t;

typedef struct {
    __IO uint32_t PVD1IRE;
    __IO uint32_t PVD1IRS;
    __IO uint32_t PVD1CMPOE;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2IRE;
    __IO uint32_t PVD2IRS;
    __IO uint32_t PVD2CMPOE;
    uint32_t RESERVED1[1];
} stc_pwc_pvdcr1_bit_t;

typedef struct {
    __IO uint32_t PVD1NFDIS;
    __IO uint32_t PVD1NFCKS0;
    __IO uint32_t PVD1NFCKS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NFDIS;
    __IO uint32_t PVD2NFCKS0;
    __IO uint32_t PVD2NFCKS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdfcr_bit_t;

typedef struct {
    __IO uint32_t WKE00;
    __IO uint32_t WKE01;
    __IO uint32_t WKE02;
    __IO uint32_t WKE03;
    __IO uint32_t WKE10;
    __IO uint32_t WKE11;
    __IO uint32_t WKE12;
    __IO uint32_t WKE13;
} stc_pwc_pdwke0_bit_t;

typedef struct {
    __IO uint32_t WKE20;
    __IO uint32_t WKE21;
    __IO uint32_t WKE22;
    __IO uint32_t WKE23;
    __IO uint32_t WKE30;
    __IO uint32_t WKE31;
    __IO uint32_t WKE32;
    __IO uint32_t WKE33;
} stc_pwc_pdwke1_bit_t;

typedef struct {
    __IO uint32_t VD1WKE;
    __IO uint32_t VD2WKE;
    uint32_t RESERVED0[2];
    __IO uint32_t RTCPRDWKE;
    __IO uint32_t RTCALMWKE;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKE;
} stc_pwc_pdwke2_bit_t;

typedef struct {
    __IO uint32_t WK0EGS;
    __IO uint32_t WK1EGS;
    __IO uint32_t WK2EGS;
    __IO uint32_t WK3EGS;
    __IO uint32_t VD1EGS;
    __IO uint32_t VD2EGS;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkes_bit_t;

typedef struct {
    __IO uint32_t PTWK0F;
    __IO uint32_t PTWK1F;
    __IO uint32_t PTWK2F;
    __IO uint32_t PTWK3F;
    __IO uint32_t VD1WKF;
    __IO uint32_t VD2WKF;
    uint32_t RESERVED0[2];
} stc_pwc_pdwkf0_bit_t;

typedef struct {
    uint32_t RESERVED0[3];
    __IO uint32_t RXD0WKF;
    __IO uint32_t RTCPRDWKF;
    __IO uint32_t RTCALMWKF;
    uint32_t RESERVED1[1];
    __IO uint32_t WKTMWKF;
} stc_pwc_pdwkf1_bit_t;

typedef struct {
    __IO uint32_t RAMPDC0;
    __IO uint32_t RAMPDC1;
    __IO uint32_t RAMPDC2;
    __IO uint32_t RAMPDC3;
    __IO uint32_t RAMPDC4;
    __IO uint32_t RAMPDC5;
    __IO uint32_t RAMPDC6;
    __IO uint32_t RAMPDC7;
    __IO uint32_t RAMPDC8;
    __IO uint32_t RAMPDC9;
    __IO uint32_t RAMPDC10;
    uint32_t RESERVED0[21];
} stc_pwc_rampc0_bit_t;

typedef struct {
    __IO uint32_t PRAMPDC0;
    __IO uint32_t PRAMPDC1;
    __IO uint32_t PRAMPDC2;
    __IO uint32_t PRAMPDC3;
    __IO uint32_t PRAMPDC4;
    __IO uint32_t PRAMPDC5;
    __IO uint32_t PRAMPDC6;
    __IO uint32_t PRAMPDC7;
    __IO uint32_t PRAMPDC8;
    __IO uint32_t PRAMPDC9;
    uint32_t RESERVED0[22];
} stc_pwc_pramlpc_bit_t;

typedef struct {
    __IO uint32_t PVD1NMIS;
    __IO uint32_t PVD1EDGS0;
    __IO uint32_t PVD1EDGS1;
    uint32_t RESERVED0[1];
    __IO uint32_t PVD2NMIS;
    __IO uint32_t PVD2EDGS0;
    __IO uint32_t PVD2EDGS1;
    uint32_t RESERVED1[1];
} stc_pwc_pvdicr_bit_t;

typedef struct {
    __IO uint32_t PVD1MON;
    __IO uint32_t PVD1DETFLG;
    uint32_t RESERVED0[2];
    __IO uint32_t PVD2MON;
    __IO uint32_t PVD2DETFLG;
    uint32_t RESERVED1[2];
} stc_pwc_pvddsr_bit_t;

