RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
typedef struct {
    __IO uint32_t FLNWT;
    __IO uint32_t CKSMRC;
    uint32_t RESERVED0[12];
    __IO uint32_t EXBUSOE;
    __IO uint32_t STOP;
} stc_pwc_stpmcr_bit_t;

typedef struct {
    __IO uint32_t FPRCB0;
    __IO uint32_t FPRCB1;
    __IO uint32_t FPRCB2;
    __IO uint32_t FPRCB3;
    uint32_t RESERVED0[12];
} stc_pwc_fprc_bit_t;

typedef struct {
    uint32_t RESERVED0[5];
    __IO uint32_t LKUPREN;
    uint32_t RESERVED1[2];
} stc_rmu_prstcr0_bit_t;

typedef struct {
    __IO uint32_t PORF;
    __IO uint32_t PINRF;
    __IO uint32_t BORF;
    __IO uint32_t PVD1RF;
    __IO uint32_t PVD2RF;
    __IO uint32_t WDRF;
    __IO uint32_t SWDRF;
    __IO uint32_t PDRF;
    __IO uint32_t SWRF;
    __IO uint32_t MPUERF;
    __IO uint32_t RAPERF;
    __IO uint32_t RAECRF;
    __IO uint32_t CKFERF;
    __IO uint32_t XTALERF;
    __IO uint32_t LKUPRF;
    uint32_t RESERVED0[15];
    __IO uint32_t MULTIRF;
    __IO uint32_t CLRF;
} stc_rmu_rstf0_bit_t;

typedef struct {
    __IO uint32_t RESET;
    uint32_t RESERVED0[7];
} stc_rtc_cr0_bit_t;

typedef struct {
    __IO uint32_t PRDS0;
    __IO uint32_t PRDS1;
    __IO uint32_t PRDS2;
    __IO uint32_t AMPM;
    uint32_t RESERVED0[1];
    __IO uint32_t ONEHZOE;
    __IO uint32_t ONEHZSEL;
    __IO uint32_t START;
} stc_rtc_cr1_bit_t;

typedef struct {
    __IO uint32_t RWREQ;
    __IO uint32_t RWEN;
    __IO uint32_t PRDF;
    __IO uint32_t ALMF;
    uint32_t RESERVED0[1];
    __IO uint32_t PRDIE;
    __IO uint32_t ALMIE;
    __IO uint32_t ALME;
} stc_rtc_cr2_bit_t;

typedef struct {
    uint32_t RESERVED0[4];
    __IO uint32_t LRCEN;
    uint32_t RESERVED1[2];
    __IO uint32_t RCKSEL;
} stc_rtc_cr3_bit_t;

typedef struct {
    __IO uint32_t HOURU0;
    __IO uint32_t HOURU1;
    __IO uint32_t HOURU2;
    __IO uint32_t HOURU3;
    __IO uint32_t HOURD0;
    __IO uint32_t HOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_hour_bit_t;

typedef struct {
    __IO uint32_t ALMHOURU0;
    __IO uint32_t ALMHOURU1;
    __IO uint32_t ALMHOURU2;
    __IO uint32_t ALMHOURU3;
    __IO uint32_t ALMHOURD0;
    __IO uint32_t ALMHOURD1;
    uint32_t RESERVED0[2];
} stc_rtc_almhour_bit_t;

typedef struct {
    __IO uint32_t ALMWEEK0;
    __IO uint32_t ALMWEEK1;
    __IO uint32_t ALMWEEK2;
    __IO uint32_t ALMWEEK3;
    __IO uint32_t ALMWEEK4;
    __IO uint32_t ALMWEEK5;
    __IO uint32_t ALMWEEK6;
    uint32_t RESERVED0[1];
} stc_rtc_almweek_bit_t;

typedef struct {
    __IO uint32_t COMP8;
    uint32_t RESERVED0[6];
    __IO uint32_t COMPEN;
} stc_rtc_errcrh_bit_t;

typedef struct {
    __IO uint32_t TPCT00;
    __IO uint32_t TPCT01;
    __IO uint32_t TPNF00;
    __IO uint32_t TPNF01;
    __IO uint32_t TPRSTE0;
    __IO uint32_t TPIE0;
    __IO uint32_t TSTPE0;
    __IO uint32_t TPEN0;
} stc_rtc_tpcr0_bit_t;

typedef struct {
    __IO uint32_t TPCT10;
    __IO uint32_t TPCT11;
    __IO uint32_t TPNF10;
    __IO uint32_t TPNF11;
    __IO uint32_t TPRSTE1;
    __IO uint32_t TPIE1;
    __IO uint32_t TSTPE1;
    __IO uint32_t TPEN1;
} stc_rtc_tpcr1_bit_t;

typedef struct {
    __IO uint32_t TPF0;
    __IO uint32_t TPF1;
    __IO uint32_t TPOVF;
    uint32_t RESERVED0[5];
} stc_rtc_tpsr_bit_t;

typedef struct {
    __IO uint32_t HOURTPU0;
    __IO uint32_t HOURTPU1;
    __IO uint32_t HOURTPU2;
    __IO uint32_t HOURTPU3;
    __IO uint32_t HOURTPD0;
    __IO uint32_t HOURTPD1;
    uint32_t RESERVED0[2];
} stc_rtc_hourtp_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t BCE;
    __IO uint32_t ATCEN0;
    __IO uint32_t ATCEN1;
    __IO uint32_t DDIR;
    __IO uint32_t MULB;
    uint32_t RESERVED1[10];
} stc_sdioc_transmode_bit_t;

typedef struct {
    __IO uint32_t RESTYP0;
    __IO uint32_t RESTYP1;
    uint32_t RESERVED0[1];
    __IO uint32_t CCE;
    __IO uint32_t ICE;
    __IO uint32_t DAT;
    __IO uint32_t TYP0;
    __IO uint32_t TYP1;
    __IO uint32_t IDX0;
    __IO uint32_t IDX1;
    __IO uint32_t IDX2;
    __IO uint32_t IDX3;
    __IO uint32_t IDX4;
    __IO uint32_t IDX5;
    uint32_t RESERVED1[2];
} stc_sdioc_cmd_bit_t;

typedef struct {
    __I  uint32_t CIC;
    __I  uint32_t CID;
    __I  uint32_t DA;
    uint32_t RESERVED0[5];
    __I  uint32_t WTA;
    __I  uint32_t RTA;
    __I  uint32_t BWE;
    __I  uint32_t BRE;
    uint32_t RESERVED1[4];
    __I  uint32_t CIN;
    __I  uint32_t CSS;
    __I  uint32_t CDL;
    __I  uint32_t WPL;
    __I  uint32_t DATL0;
    __I  uint32_t DATL1;
    __I  uint32_t DATL2;
    __I  uint32_t DATL3;
    __I  uint32_t CMDL;
    uint32_t RESERVED2[7];
} stc_sdioc_pstat_bit_t;

typedef struct {
    uint32_t RESERVED0[1];
    __IO uint32_t DW;
    __IO uint32_t HSEN;
    uint32_t RESERVED1[2];
    __IO uint32_t EXDW;
    __IO uint32_t CDTL;
    __IO uint32_t CDSS;
} stc_sdioc_hostcon_bit_t;

typedef struct {
    __IO uint32_t PWON;
    uint32_t RESERVED0[7];
} stc_sdioc_pwrcon_bit_t;

typedef struct {
    __IO uint32_t SABGR;
    __IO uint32_t CR;
    __IO uint32_t RWC;
    __IO uint32_t IABG;
    uint32_t RESERVED0[4];
} stc_sdioc_blkgpcon_bit_t;

typedef struct {
    __IO uint32_t ICE;
    uint32_t RESERVED0[1];
    __IO uint32_t CE;
    uint32_t RESERVED1[5];
    __IO uint32_t FS0;
    __IO uint32_t FS1;
    __IO uint32_t FS2;
    __IO uint32_t FS3;
    __IO uint32_t FS4;
    __IO uint32_t FS5;
    __IO uint32_t FS6;
    __IO uint32_t FS7;
} stc_sdioc_clkcon_bit_t;

typedef struct {
    __IO uint32_t RSTA;
    __IO uint32_t RSTC;
    __IO uint32_t RSTD;
    uint32_t RESERVED0[5];
} stc_sdioc_sftrst_bit_t;

typedef struct {
    __IO uint32_t CC;
    __IO uint32_t TC;
    __IO uint32_t BGE;
    uint32_t RESERVED0[1];
    __IO uint32_t BWR;
    __IO uint32_t BRR;
    __IO uint32_t CIST;
    __IO uint32_t CRM;
    __I  uint32_t CINT;
    uint32_t RESERVED1[6];
    __I  uint32_t EI;
} stc_sdioc_norintst_bit_t;

typedef struct {
    __IO uint32_t CTOE;
    __IO uint32_t CCE;
    __IO uint32_t CEBE;
    __IO uint32_t CIE;
    __IO uint32_t DTOE;
    __IO uint32_t DCE;
    __IO uint32_t DEBE;
    uint32_t RESERVED0[1];
    __IO uint32_t ACE;
    uint32_t RESERVED1[7];
} stc_sdioc_errintst_bit_t;

