RT-Thread/rt-thread/bsp/hc32/libraries/hc32f4a0_ddl/drivers/cmsis/Device/HDSC/hc32f4xx/Include/hc32f4a0.h
    stc_gpio_pcr_bit_t                       PCRI1_b;
    stc_gpio_pfsr_bit_t                      PFSRI1_b;
    stc_gpio_pcr_bit_t                       PCRI2_b;
    stc_gpio_pfsr_bit_t                      PFSRI2_b;
    stc_gpio_pcr_bit_t                       PCRI3_b;
    stc_gpio_pfsr_bit_t                      PFSRI3_b;
    stc_gpio_pcr_bit_t                       PCRI4_b;
    stc_gpio_pfsr_bit_t                      PFSRI4_b;
    stc_gpio_pcr_bit_t                       PCRI5_b;
    stc_gpio_pfsr_bit_t                      PFSRI5_b;
    stc_gpio_pcr_bit_t                       PCRI6_b;
    stc_gpio_pfsr_bit_t                      PFSRI6_b;
    stc_gpio_pcr_bit_t                       PCRI7_b;
    stc_gpio_pfsr_bit_t                      PFSRI7_b;
    stc_gpio_pcr_bit_t                       PCRI8_b;
    stc_gpio_pfsr_bit_t                      PFSRI8_b;
    stc_gpio_pcr_bit_t                       PCRI9_b;
    stc_gpio_pfsr_bit_t                      PFSRI9_b;
    stc_gpio_pcr_bit_t                       PCRI10_b;
    stc_gpio_pfsr_bit_t                      PFSRI10_b;
    stc_gpio_pcr_bit_t                       PCRI11_b;
    stc_gpio_pfsr_bit_t                      PFSRI11_b;
    stc_gpio_pcr_bit_t                       PCRI12_b;
    stc_gpio_pfsr_bit_t                      PFSRI12_b;
    stc_gpio_pcr_bit_t                       PCRI13_b;
    stc_gpio_pfsr_bit_t                      PFSRI13_b;
} bCM_GPIO_TypeDef;

typedef struct {
    stc_hash_cr_bit_t                        CR_b;
} bCM_HASH_TypeDef;

typedef struct {
    stc_hrpwm_cr_bit_t                       CR1_b;
    stc_hrpwm_cr_bit_t                       CR2_b;
    stc_hrpwm_cr_bit_t                       CR3_b;
    stc_hrpwm_cr_bit_t                       CR4_b;
    stc_hrpwm_cr_bit_t                       CR5_b;
    stc_hrpwm_cr_bit_t                       CR6_b;
    stc_hrpwm_cr_bit_t                       CR7_b;
    stc_hrpwm_cr_bit_t                       CR8_b;
    stc_hrpwm_cr_bit_t                       CR9_b;
    stc_hrpwm_cr_bit_t                       CR10_b;
    stc_hrpwm_cr_bit_t                       CR11_b;
    stc_hrpwm_cr_bit_t                       CR12_b;
    stc_hrpwm_cr_bit_t                       CR13_b;
    stc_hrpwm_cr_bit_t                       CR14_b;
    stc_hrpwm_cr_bit_t                       CR15_b;
    stc_hrpwm_cr_bit_t                       CR16_b;
    uint32_t                                 RESERVED0[128];
    stc_hrpwm_calcr_bit_t                    CALCR0_b;
    stc_hrpwm_calcr_bit_t                    CALCR1_b;
} bCM_HRPWM_TypeDef;

typedef struct {
    stc_i2c_cr1_bit_t                        CR1_b;
    stc_i2c_cr2_bit_t                        CR2_b;
    stc_i2c_cr3_bit_t                        CR3_b;
    stc_i2c_cr4_bit_t                        CR4_b;
    stc_i2c_slr0_bit_t                       SLR0_b;
    stc_i2c_slr1_bit_t                       SLR1_b;
    uint32_t                                 RESERVED0[32];
    stc_i2c_sr_bit_t                         SR_b;
    stc_i2c_clr_bit_t                        CLR_b;
    uint32_t                                 RESERVED1[96];
    stc_i2c_fltr_bit_t                       FLTR_b;
} bCM_I2C_TypeDef;

typedef struct {
    stc_i2s_ctrl_bit_t                       CTRL_b;
    stc_i2s_sr_bit_t                         SR_b;
    stc_i2s_er_bit_t                         ER_b;
    stc_i2s_cfgr_bit_t                       CFGR_b;
} bCM_I2S_TypeDef;

typedef struct {
    stc_icg_icg0_bit_t                       ICG0_b;
    stc_icg_icg1_bit_t                       ICG1_b;
} bCM_ICG_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_intc_nmienr_bit_t                    NMIENR_b;
    stc_intc_nmifr_bit_t                     NMIFR_b;
    stc_intc_nmicfr_bit_t                    NMICFR_b;
    stc_intc_eirqcr_bit_t                    EIRQCR0_b;
    stc_intc_eirqcr_bit_t                    EIRQCR1_b;
    stc_intc_eirqcr_bit_t                    EIRQCR2_b;
    stc_intc_eirqcr_bit_t                    EIRQCR3_b;
    stc_intc_eirqcr_bit_t                    EIRQCR4_b;
    stc_intc_eirqcr_bit_t                    EIRQCR5_b;
    stc_intc_eirqcr_bit_t                    EIRQCR6_b;
    stc_intc_eirqcr_bit_t                    EIRQCR7_b;
    stc_intc_eirqcr_bit_t                    EIRQCR8_b;
    stc_intc_eirqcr_bit_t                    EIRQCR9_b;
    stc_intc_eirqcr_bit_t                    EIRQCR10_b;
    stc_intc_eirqcr_bit_t                    EIRQCR11_b;
    stc_intc_eirqcr_bit_t                    EIRQCR12_b;
    stc_intc_eirqcr_bit_t                    EIRQCR13_b;
    stc_intc_eirqcr_bit_t                    EIRQCR14_b;
    stc_intc_eirqcr_bit_t                    EIRQCR15_b;
    stc_intc_wupen_bit_t                     WUPEN_b;
    stc_intc_eirqfr_bit_t                    EIRQFR_b;
    stc_intc_eirqcfr_bit_t                   EIRQCFR_b;
    uint32_t                                 RESERVED1[4096];
    stc_intc_vssel_bit_t                     VSSEL128_b;
    stc_intc_vssel_bit_t                     VSSEL129_b;
    stc_intc_vssel_bit_t                     VSSEL130_b;
    stc_intc_vssel_bit_t                     VSSEL131_b;
    stc_intc_vssel_bit_t                     VSSEL132_b;
    stc_intc_vssel_bit_t                     VSSEL133_b;
    stc_intc_vssel_bit_t                     VSSEL134_b;
    stc_intc_vssel_bit_t                     VSSEL135_b;
    stc_intc_vssel_bit_t                     VSSEL136_b;
    stc_intc_vssel_bit_t                     VSSEL137_b;
    stc_intc_vssel_bit_t                     VSSEL138_b;
    stc_intc_vssel_bit_t                     VSSEL139_b;
    stc_intc_vssel_bit_t                     VSSEL140_b;
    stc_intc_vssel_bit_t                     VSSEL141_b;
    stc_intc_vssel_bit_t                     VSSEL142_b;
    stc_intc_vssel_bit_t                     VSSEL143_b;
    stc_intc_swier_bit_t                     SWIER_b;
    stc_intc_evter_bit_t                     EVTER_b;
    stc_intc_ier_bit_t                       IER_b;
} bCM_INTC_TypeDef;

